app/Auth/CachedUserProvider.php

select "id", "username", "name", "role", "ID_Admin", "password" from "users" where "users"."id" = 'admin' limit 1
---
    public function retrieveById($identifier)
    {
        return Cache::remember('user_auth_id_' . $identifier, 3600, function () use ($identifier) {
            return $this->createModel()->newQuery()
                ->select(['id', 'username', 'name', 'role', 'NoTelp_User', 'Alamat_User', 'password'])
                ->find($identifier);
        });