app/Http/Controllers/DashboardController.php

select sum("Total_Harga") as aggregate from "penjualans" where "Tanggal_Penjualan"::date = '2026-05-24'
select sum("Total_Harga") as aggregate from "pembelians" where "Tgl_Pembelian"::date = '2026-05-24'
select sum("Stok_Akhir") as aggregate from "stok_barangs"
select * from "penjualans" order by "Tanggal_Penjualan" desc limit 5
select * from "pembelians" order by "Tgl_Pembelian" desc limit 5
---
    public function index()
    {
        $today = Carbon::today();

        // 1. Penjualan Hari Ini
        $penjualan_hari_ini = Penjualan::whereDate('Tanggal_Penjualan', $today)->sum('Total_Harga');

        // 2. Pembelian Hari Ini
        $pembelian_hari_ini = Pembelian::whereDate('Tgl_Pembelian', $today)->sum('Total_Harga');

        // 3. Total Stok Akhir
        $total_stok = StokBarang::sum('Stok_Akhir');

        $stats = [
            'penjualan_hari_ini' => 'Rp ' . number_format($penjualan_hari_ini, 0, ',', '.'),
            'pembelian_hari_ini' => 'Rp ' . number_format($pembelian_hari_ini, 0, ',', '.'),
            'total_stok' => number_format($total_stok, 0, ',', '.')
        ];

        // 4. Aktivitas Terbaru (Gabungan Penjualan & Pembelian)
        $recent_penjualan = Penjualan::with('dataBarang')
            ->orderBy('Tanggal_Penjualan', 'desc')
            ->take(5)
            ->get()
            ->map(function ($item) {
                return [
                    'date' => Carbon::parse($item->Tanggal_Penjualan)->format('d-m-Y'),
                    'tipe' => 'Penjualan',
                    'produk' => $item->dataBarang->Nama_Barang ?? 'Unknown',
                    'nominal' => 'Rp ' . number_format($item->Total_Harga, 0, ',', '.')
                ];
            });

        $recent_pembelian = Pembelian::with('dataBarang')
            ->orderBy('Tgl_Pembelian', 'desc')
            ->take(5)
            ->get()
            ->map(function ($item) {
                return [
                    'date' => Carbon::parse($item->Tgl_Pembelian)->format('d-m-Y'),
                    'tipe' => 'Pembelian',
                    'produk' => $item->dataBarang->Nama_Barang ?? 'Unknown',
                    'nominal' => 'Rp ' . number_format($item->Total_Harga, 0, ',', '.')
                ];
            });

select * from "stok_barangs" where "Stok_Akhir" < 10 limit 5
---
            ->values();

        // 5. Stok Kritis (Stok Akhir < 10)
        $critical_stocks = StokBarang::with('dataBarang')
            ->where('Stok_Akhir', '<', 10)
            ->take(5)
            ->get()
            ->map(function ($item) {
                return [
                    'name' => $item->dataBarang->Nama_Barang ?? 'Unknown',
                    'level' => $item->Stok_Akhir
                ];
            });