app/Http/Controllers/ExportImportController.php

    public function exportCSV($type)
    {
        $headers = [
            'Content-Type' => 'text/csv',
            'Content-Disposition' => "attachment; filename=data_{$type}_export.csv",
        ];

        $data = match($type) {
            'pelanggan' => Pelanggan::all(['Nama_Pelanggan', 'Alamat_Pelanggan', 'NoTelp_Pelanggan'])->toArray(),
            'pemasok' => Pemasok::all(['Nama_Pemasok', 'Alamat_Pemasok', 'NoTelp_Pemasok'])->toArray(),
            'barang' => DataBarang::with('pemasok')->get()->map(function($b) {
                return [
                    'Nama_Barang' => $b->Nama_Barang,
                    'Jenis_Barang' => $b->Jenis_Barang,
                    'Warna_Barang' => $b->Warna_Barang,
                    'Ukuran_Barang' => $b->Ukuran_Barang,
                    'Nama_Pemasok' => $b->pemasok->Nama_Pemasok ?? '-',
                    'Harga_Beli' => $b->Harga_Beli,
                    'Harga_Jual' => $b->Harga_Jual,
                ];
            })->toArray(),
            'admin' => Admin::with('user')->get()->map(function($a) {
                return [
                    'Username' => $a->user->username ?? '-',
                    'Nama' => $a->Nama_Admin,
                    'No_Telp' => $a->NoTelp_Admin,
                    'Role' => $a->user->role ?? '-',
                ];
            })->toArray(),
            'pembelian' => Pembelian::with(['pemasok', 'dataBarang'])->get()->map(function($p) {
                return [
                    'Tgl_Pembelian' => $p->Tgl_Pembelian,
                    'Kuantitas' => $p->Kuantitas,
                    'Jenis_Pembayaran' => $p->Jenis_Pembayaran,
                    'Ongkir' => $p->Ongkir,
                    'Nama_Pemasok' => $p->pemasok->Nama_Pemasok ?? '-',
                    'Nama_Barang' => $p->dataBarang->Nama_Barang ?? '-',
                ];
            })->toArray(),
---
select * from "pembelians"

    public function importCSV(Request $request, $type)
    {
        $request->validate([
            'file' => 'required|mimes:csv,txt'
        ]);

        $file = fopen($request->file('file')->getRealPath(), 'r');

        // Skip BOM if present
        $bom = fread($file, 3);
        if ($bom != chr(0xEF).chr(0xBB).chr(0xBF)) {
            rewind($file);
        }

        $header = fgetcsv($file, 0, ';'); // Use semicolon

        DB::beginTransaction();
        try {
            while (($row = fgetcsv($file, 0, ';')) !== FALSE) {
                if (empty($row[0])) continue;

                match($type) {
                    'pelanggan' => Pelanggan::create([
                        'ID_Pelanggan' => 'PLG-' . strtoupper(Str::random(8)),
                        'Nama_Pelanggan' => $row[0],
                        'Alamat_Pelanggan' => $row[1],
                        'NoTelp_Pelanggan' => $row[2],
                    ]),
---
insert into "pelanggans" ("ID_Pelanggan", "Nama_Pelanggan", "Alamat_Pelanggan", "NoTelp_Pelanggan", "updated_at", "created_at") values ('PLG-JRSUQXBZ', 'Ahmad Subardjo', 'Jl. Merdeka No. 10, Jakarta', '081234567001', '2026-05-23 15:36:54', '2026-05-23 15:36:54')