app/Http/Controllers/ExportImportController.php

                    $headings = ['ID Pengguna', 'Username', 'Nama Lengkap', 'Hak Akses', 'No. Telepon', 'Alamat'];
                    break;
                case 'pembelian':
                    $data = Pembelian::with(['pemasok', 'dataBarang'])->get()->map(function($item) {
                        return [
                            'ID' => $item->ID_Pembelian,
                            'Tgl' => $item->Tgl_Pembelian,
                            'Produk' => $item->dataBarang->Nama_Barang ?? '-',
                            'Pemasok' => $item->pemasok->Nama_Pemasok ?? '-',
                            'ID_PMS' => $item->ID_Pemasok,
                            'Qty' => $item->Kuantitas,
                            'Payment' => $item->jenis_pembayaran,
                            'Total' => $item->Total_Harga
                        ];
                    });
---
select * from "pemasoks" where "pemasoks"."ID_Pemasok" in ('PMS-0001', 'PMS-0007')