app/Http/Controllers/PelangganController.php

    public function index(Request $request)
    {
        $sortBy = $request->input('sort_by', 'Nama_Pelanggan');
        $sortDir = $request->input('sort_dir', 'asc');
        $perPage = $request->input('per_page', 50);
        if ($perPage === 'all') $perPage = 9999;

        $pelanggans = Pelanggan::orderBy($sortBy, $sortDir)
            ->paginate($perPage)
            ->withQueryString();
---
select * from "pelanggans" order by "Nama_Pelanggan" asc limit 50 offset 0
select count(*) as aggregate from "pelanggans"

    public function update(Request $request, $id)
    {
        $request->validate([
            'Nama_Pelanggan' => 'required|string|max:255',
            'Alamat_Pelanggan' => 'required|string',
            'NoTelp_Pelanggan' => 'required|string|max:20',
        ]);

        $pelanggan = Pelanggan::findOrFail($id);

        try {
            $pelanggan->update($request->all());
---
select * from "pelanggans" where "pelanggans"."ID_Pelanggan" = 'PLG-0012' limit 1

    public function destroy($id)
    {
        $pelanggan = Pelanggan::findOrFail($id);

        try {
            $pelanggan->delete();
---
delete from "pelanggans" where "ID_Pelanggan" = 'PLG-0012'