app/Http/Controllers/PemasokController.php

    public function index(Request $request)
    {
        $search = $request->input('search');
        $sortBy = $request->input('sort_by', 'Nama_Pemasok');
        $sortDir = $request->input('sort_dir', 'asc');
        $perPage = $request->input('per_page', 50);
        if ($perPage === 'all') $perPage = 9999;

        $pemasoks = Pemasok::when($search, function($q) use ($search) {
                $q->where(function($sub) use ($search) {
                    $sub->where('Nama_Pemasok', 'ilike', "%{$search}%")
                        ->orWhere('ID_Pemasok', 'ilike', "%{$search}%")
                        ->orWhere('NoTelp_Pemasok', 'ilike', "%{$search}%");
                });
            })
            ->orderBy($sortBy, $sortDir)
            ->paginate($perPage)
            ->withQueryString();
---
select * from "pemasoks" order by "Nama_Pemasok" asc limit 50 offset 0
select count(*) as aggregate from "pemasoks"