app/Http/Controllers/PembelianController.php

    public function index(Request $request)
    {
        $search = $request->input('search');
        $sortBy = $request->input('sort_by', 'Tgl_Pembelian');
        $sortDir = $request->input('sort_dir', 'desc');
        $perPage = $request->input('per_page', 50);
        if ($perPage === 'all') $perPage = 9999;

        $pembelians = Pembelian::with(['dataBarang', 'pemasok', 'user'])
            ->when($search, function($q) use ($search) {
                $q->where(function($sub) use ($search) {
                    $sub->where('ID_Pembelian', 'ilike', "%{$search}%")
                        ->orWhere('ID_Barang', 'ilike', "%{$search}%")
                        ->orWhere('ID_Pemasok', 'ilike', "%{$search}%");
                });
            })
            ->orderBy($sortBy, $sortDir)
            ->paginate($perPage)
            ->withQueryString();
---
select * from "data_barangs" where "data_barangs"."ID_Barang" in ('BRG-0001', 'BRG-0002', 'BRG-0003', 'BRG-0004', 'BRG-0005')
select * from "pemasoks" where "pemasoks"."ID_Pemasok" in ('PMS-0001', 'PMS-0002', 'PMS-0003', 'PMS-0007')
select * from "pembelians" order by "Tgl_Pembelian" desc limit 50 offset 0
select count(*) as aggregate from "pembelians"