app/Http/Controllers/PenjualanController.php

select * from "data_barangs" where "data_barangs"."ID_Barang" in ('BRG-0001', 'BRG-0003')
select * from "pelanggans" where "pelanggans"."ID_Pelanggan" in ('PLG-0001', 'PLG-0002', 'PLG-0005')
select * from "penjualans" order by "Tanggal_Penjualan" desc limit 50 offset 0
select * from "users" where "users"."id" in ('93e20e41-44a0-4ef1-8215-64d4dcb32923')
---
    public function index(Request $request)
    {
        $search = $request->input('search');
        $sortBy = $request->input('sort_by', 'Tanggal_Penjualan');
        $sortDir = $request->input('sort_dir', 'desc');
        $perPage = $request->input('per_page', 50);
        if ($perPage === 'all') $perPage = 9999;

        $penjualans = Penjualan::with(['dataBarang', 'pelanggan', 'user'])
            ->when($search, function($q) use ($search) {
                $q->where(function($sub) use ($search) {
                    $sub->where('ID_Penjualan', 'ilike', "%{$search}%")
                        ->orWhere('ID_Barang', 'ilike', "%{$search}%")
                        ->orWhere('ID_Pelanggan', 'ilike', "%{$search}%");
                });
            })
            ->orderBy($sortBy, $sortDir)
            ->paginate($perPage)
            ->withQueryString();

select * from "stok_barangs" where "ID_Barang" = 'BRG-0003' limit 1
---
    public function store(Request $request)
    {
        // 1. Audit: Input name casing must match Blade, but Model maps to lowercase
        $request->validate([
            'ID_Barang' => 'required|string|exists:data_barangs,ID_Barang',
            'ID_Pelanggan' => 'required|string|exists:pelanggans,ID_Pelanggan',
            'Tanggal_Penjualan' => 'required|date',
            'Kuantitas' => 'required|integer|min:1',
            'Jenis_Pembayaran' => 'required|string',
            'Ongkir' => 'required|numeric|min:0',
        ], [
            'ID_Barang.exists' => 'Produk yang dipilih tidak ditemukan dalam katalog.',
            'ID_Pelanggan.exists' => 'Data pelanggan tidak valid.',
        ]);

        $barang = DataBarang::findOrFail($request->ID_Barang);

insert into "penjualans" ("ID_Penjualan", "user_id", "ID_Barang", "ID_Pelanggan", "Tanggal_Penjualan", "Kuantitas", "Jenis_Pembayaran", "Total_Harga_Barang", "Ongkir", "Total_Harga", "updated_at", "created_at") values ('PJ-FFQ25QLQ', 'aedae7df-6224-4bdf-a4f9-4c4777fff31f', 'BRG-0003', 'PLG-0003', '2026-05-24', '10', 'Tunai', 1850000, '90000', 1940000, '2026-05-24 01:38:41', '2026-05-24 01:38:41')
---
            $newId = Penjualan::generateId('PJ');

            // 3. Audit: Mass Assignment and ID Assignment
            $penjualan = Penjualan::create([
                'ID_Penjualan' => $newId,
                'user_id' => auth()->id(),
                'ID_Barang' => $request->ID_Barang,
                'ID_Pelanggan' => $request->ID_Pelanggan,
                'Tanggal_Penjualan' => $request->Tanggal_Penjualan,
                'Kuantitas' => $request->Kuantitas,
                'jenis_pembayaran' => $request->Jenis_Pembayaran,
                'Total_Harga_Barang' => $total_harga_barang,
                'Ongkir' => $request->Ongkir,
                'Total_Harga' => $total_harga,
            ]);