app/Http/Controllers/ReportController.php

    public function pembelian(Request $request)
    {
        $start_date = $request->input('start_date', Carbon::now()->subMonth()->toDateString());
        $end_date = $request->input('end_date', Carbon::now()->toDateString());
        $search = $request->input('search');

        $query = Pembelian::with(['dataBarang', 'pemasok'])
            ->whereBetween('Tgl_Pembelian', [$start_date, $end_date]);

        if ($search) {
            $query->where(function($q) use ($search) {
                $q->where('ID_Pembelian', 'ilike', "%{$search}%")
                  ->orWhere('ID_Barang', 'ilike', "%{$search}%")
                  ->orWhere('ID_Pemasok', 'ilike', "%{$search}%")
                  ->orWhereHas('dataBarang', function($sub) use ($search) {
                      $sub->where('Nama_Barang', 'ilike', "%{$search}%");
                  })
                  ->orWhereHas('pemasok', function($sub) use ($search) {
                      $sub->where('Nama_Pemasok', 'ilike', "%{$search}%");
                  });
            });
        }

        $pembelians = $query->orderBy('Tgl_Pembelian', 'desc')->get();

        // Analytics Summary
        $summary = [
            'total_pengeluaran' => $pembelians->sum('Total_Harga'),
            'total_barang_masuk' => $pembelians->sum('Kuantitas'),
---
select * from "stok_barangs"