app/Http/Controllers/ReportController.php

    public function pembelian(Request $request)
    {
        $start_date = $request->input('start_date', Carbon::now()->subYear()->toDateString());
        $end_date = $request->input('end_date', Carbon::now()->toDateString());
        $search = $request->input('search');

        $pembelians = Pembelian::with(['dataBarang', 'pemasok'])
            ->whereBetween('Tgl_Pembelian', [$start_date, $end_date])
            ->when($search, function($query) use ($search) {
                $query->where(function($q) use ($search) {
                    $q->where('ID_Pembelian', 'ilike', "%{$search}%")
                      ->orWhere('ID_Barang', 'ilike', "%{$search}%")
                      ->orWhere('ID_Pemasok', 'ilike', "%{$search}%")
                      ->orWhereHas('dataBarang', function($sub) use ($search) {
                          $sub->where('Nama_Barang', 'ilike', "%{$search}%");
                      })
                      ->orWhereHas('pemasok', function($sub) use ($search) {
                          $sub->where('Nama_Pemasok', 'ilike', "%{$search}%");
                      });
                });
            })
            ->orderBy('Tgl_Pembelian', 'desc')
            ->get();
---
select * from "data_barangs" where "data_barangs"."ID_Barang" in ('BRG-0001', 'BRG-0002', 'BRG-0003')
select * from "pemasoks" where "pemasoks"."ID_Pemasok" in ('PMS-0002', 'PMS-0003')
select * from "pembelians" where "Tgl_Pembelian" between '2026-05-01' and '2026-05-24' order by "Tgl_Pembelian" desc

    public function penjualan(Request $request)
    {
        $start_date = $request->input('start_date', Carbon::now()->subYear()->toDateString());
        $end_date = $request->input('end_date', Carbon::now()->toDateString());
        $search = $request->input('search');

        $penjualans = Penjualan::with(['dataBarang', 'pelanggan'])
            ->whereBetween('Tanggal_Penjualan', [$start_date, $end_date])
            ->when($search, function($query) use ($search) {
                $query->where(function($q) use ($search) {
                    $q->where('ID_Penjualan', 'ilike', "%{$search}%")
                      ->orWhere('ID_Barang', 'ilike', "%{$search}%")
                      ->orWhere('ID_Pelanggan', 'ilike', "%{$search}%")
                      ->orWhereHas('dataBarang', function($sub) use ($search) {
                          $sub->where('Nama_Barang', 'ilike', "%{$search}%");
                      })
                      ->orWhereHas('pelanggan', function($sub) use ($search) {
                          $sub->where('Nama_Pelanggan', 'ilike', "%{$search}%");
                      });
                });
            })
            ->orderBy('Tanggal_Penjualan', 'desc')
            ->get();
---
select * from "pelanggans" where "pelanggans"."ID_Pelanggan" in ('PLG-0002', 'PLG-0005', 'PLG-0008')
select * from "penjualans" where "Tanggal_Penjualan" between '2026-05-01' and '2026-05-23' order by "Tanggal_Penjualan" desc
select * from "data_barangs" where "data_barangs"."ID_Barang" in ('BRG-0001', 'BRG-0002', 'BRG-0003', 'BRG-0004', 'BRG-0005', 'BRG-0006', 'BRG-0007', 'BRG-0008', 'BRG-0009', 'BRG-0010', 'BRG-0011', 'BRG-0012')