app/Http/Controllers/StockController.php

select * from "pemasoks"
select * from "stok_barangs" where "stok_barangs"."ID_Barang" in ('BRG-0001', 'BRG-0002', 'BRG-0003', 'BRG-0004', 'BRG-0005', 'BRG-0006', 'BRG-0007', 'BRG-0008', 'BRG-0009', 'BRG-0010', 'BRG-0011', 'BRG-0012')
select count(*) as aggregate from "data_barangs"
---
    public function index(Request $request)
    {
        $search = $request->input('search');
        $sortBy = $request->input('sort_by', 'Nama_Barang');
        $sortDir = $request->input('sort_dir', 'asc');
        $perPage = $request->input('per_page', 50);
        if ($perPage === 'all') $perPage = 9999;

        $stocks = DataBarang::with(['stokBarangs', 'pemasok'])
            ->when($search, function($q) use ($search) {
                $q->where(function($sub) use ($search) {
                    $sub->where('Nama_Barang', 'ilike', "%{$search}%")
                        ->orWhere('ID_Barang', 'ilike', "%{$search}%")
                        ->orWhere('Jenis_Barang', 'ilike', "%{$search}%");
                });
            })
            ->orderBy($sortBy, $sortDir)
            ->paginate($perPage)
            ->withQueryString();