app/Http/Controllers/UserController.php

    public function index(Request $request)
    {
        $sortBy = $request->input('sort_by', 'name');
        $sortDir = $request->input('sort_dir', 'asc');
        $perPage = $request->input('per_page', 50);
        if ($perPage === 'all') $perPage = 9999;

        $users = User::orderBy($sortBy, $sortDir)
            ->paginate($perPage)
            ->withQueryString();
---
select * from "users" order by "name" asc limit 50 offset 0
select count(*) as aggregate from "users"

    public function edit($id)
    {
        if (auth()->id() !== $id) {
            return redirect()->route('data.user')->with('error', 'Anda hanya diizinkan untuk mengubah profil Anda sendiri.');
---
select * from "users" where "users"."id" = 'aedae7df-6224-4bdf-a4f9-4c4777fff31f' limit 1

    public function update(Request $request, $id)
    {
        if (auth()->id() !== $id) {
            return abort(403, 'Aksi tidak diizinkan.');
        }

        $user = User::findOrFail($id);

        $request->validate([
            'name' => 'required|string|max:255',
            'username' => ['required', 'string', 'max:255', Rule::unique('users')->ignore($user->id)],
            'password' => 'nullable|string|min:8',
            'NoTelp_User' => 'nullable|string|max:20',
            'Alamat_User' => 'nullable|string',
        ]);

        try {
            $data = $request->only(['name', 'username', 'NoTelp_User', 'Alamat_User']);

            if ($request->filled('password')) {
                $data['password'] = Hash::make($request->password);
            }

            $user->update($data);
---
select * from "users" where "users"."id" = 'd2c6a144-788f-4f83-8ef5-731d9f1fb8e2' limit 1
update "users" set "password" = '$2y$12$.iFrcDvnYEJdKoUB1siK4OYiuX1sOdapR23JMIcgxle4ZT17wIOSa', "updated_at" = '2026-05-24 00:22:46' where "id" = 'aedae7df-6224-4bdf-a4f9-4c4777fff31f'